Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: У узла-контейнера невозможно задать тип или вид данных.
en: It is impossible to set the data type and kind for the node-container.

source: Убедиться, что настройки режима активации разрешают обучение узла;
en: It is required to make sure that the activation mode settings allow for the node training.

source: Увеличить эффективность работы с данными;
en: To improve the data handling efficiency.

source: Угол - значение угла в радианах.
en: Angle - angle value in radians.

source: Удаление
en: Delete

source: Удаление ненужных полей/переменных;
en: Delete unnecessary fields/variables;

source: Удаление по ключу работает только для таблиц с движком из семейства MergeTree.
en: Deletion by key is available only for the tables with the MergeTree engines.

source: Удаление публикации
en: Delete Publication

source: Удаление, замена базового узла
en: Deletion, replacement of the base node

source: Удалить дочерний узел можно нажав на иконку УдалитьУдалить (горячая клавиша Delete), которая находится с правой части строки дочернего узла и видна при наведении курсора на строку.
en: To delete a child node, it is required to press DeleteDelete (Delete hotkey) that is located in the right part of the child node string, and it is visible only when cursor hovering over the string.

source: Удалить такую связь можно нажатием на кнопку на линии связи.
en: It is possible to delete this link by pressing button in the line.

source: Удалять записи
en: Delete records

source: Удалять записи — строки с выявленными пропусками исключаются из выходного набора данных;
en: Delete records: delete the rows with detected null data from the output data set.

source: Удовлетворительно
en: Satisfactory

source: Уже раскрытый рекурсивный узел нельзя раскрыть повторно.
en: It is not possible to open already opened recursive node repeatedly.

source: Узел Подмодель имеет надпись Войти, при нажатии которой можно открыть область построения Подмодели и реализовать в ней произвольный сценарий обработки.
en: The Supernode node contains the following text: Enter, its pressing enables to open the Supernode construction area, and execute a random processing workflow in it.

source: Узел Таблица в дерево преобразует исходные данные, представленные в виде плоской (двумерной) таблицы, в иерархическую (древовидную) форму.
en: The Table to Tree node enables to transform the source data represented in the form of the flat (two-dimensional) table to the hierarchic (tree-like) form.

source: Узел вызова REST-сервиса осуществляет проверку типа ответа, и если полученный ответ не соответствует заявленному в параметре "Тип Content-type ответа" используемого подключения, то выходные наборы данных узла будут содержать сообщения об ошибке.
en: The REST service call node checks the response type, and if the received response does not match the one stated in the "Type of Response Content-Type" parameter of the used connection, the output data sets of the node will contain error messages.

source: Узел выполняет действие аналогичное Левому соединению узла Соединение, но количество присоединяемых таблиц произвольно.
en: The node performs the action similar to the Left join of the Join node but the number of joined tables is optional.

source: Узел выполняется без переобучения Модели;
en: The Node is executed without retraining of the Model.

source: Узел выполняется с переобучением Модели.
en: The Node is executed with retraining of the Model.

source: Узел не будет выполняться;
en: The node will not be executed;

source: Узел не должен находиться в Подмодели.
en: The node must not be located in the Supernode.

source: Узел позволяет изменить следующие параметры полей набора данных:
en: The node enables to change the following features of the data set fields:

source: Узел получает индекс -1, который учитывается при сортировке.
en: The node gets -1 index that is taken into account when sorting.

source: Узел создает новый набор данных с заданным составом и параметрами полей и заполняет его данными в ходе выполнения кода JavaScript.
en: The node creates a new data set with the set composition and features of fields. It appends data to it during the JavaScript code execution.

source: Узел-ссылка позволяет получить результаты обработки (выполнения) другого узла, который может находиться за пределами текущей Подмодели, Сценария, Модуля или Пакета.
en: Reference node enables to receive results of processing (execution) of the other node that can be located outside the current Supernode, Workflow, Module or Package.

source: Узлу предназначенному для публикации задается имя, которое будет являться идентификатором метода Веб-сервиса.
en: The name is set for the node designated for publication. It will be access modifier of the Web Service method.

source: Узлы Подмодели
en: Supernode nodes

source: Узлы Сценария принимают данные через входные порты, а отдают через выходные.
en: The Workflow nodes accept data via the input ports and give them back via the output ones.

source: Узлы в дереве Инспектора свойств можно сортировать, для этого нужно кликнуть мышью на заколовок колонки Свойство.
en: It is possible to sort nodes in the Property inspector tree. For this purpose, it is required to click on the header of the Property column.

source: Узлы в свою очередь объединяются в кластеры (поле Номер кластера).
en: In their turn, the nodes are combined into clusters (Cluster number field).

source: Узлы выполняются последовательно от выходного порта к входному.
en: The nodes are successively executed from the output port to the input.

source: Узлы дерева могут иметь признаки контейнер и массив.
en: The tree nodes can have the container and array indicators.

source: Узлы основываются на компонентах, панель которых расположена в левой части программного окна.
en: The nodes are based on the components the panel of which is located in the left part of the program window.

source: Узлы с переменным числом портов, в том числе Подмодель
en: Nodes with the variable number of ports, including the Supernode

source: Узлы сценария создаются из компонентов 2-х типов:
en: The workflow nodes are created from 2 types of components :

source: Узлы, находящиеся за пределами текущей Подмодели, Сценария, Модуля или Пакета, по умолчанию недоступны для выбора.
en: The nodes that are outside the current Supernode, Workflow, Module or Package are not available for selection by default.

source: Указанные операции доступны также через контекстное меню, которое можно вызвать кликом правой клавиши мыши в любом месте Области построения.
en: The specified operations are also available via the context menu that can be called by clicking on any Construction area place with the right mouse button.

source: Указывать всегда.
en: Specify always.

source: Уменьшить объем занимаемой памяти;
en: To decrease memory footprint.

source: Уникальное значение
en: Unique value

source: Уникальные значения
en: Unique values

source: Уникальные значения поля основного источника данных, которым соответствует внешнее разбиение
en: Unique values of the main data source fields that map the external binning.

source: Уникальные.
en: Unique.

source: Упорядоченностью;
en: Degree of order

source: Упорядоченный набор
en: Ordered set

source: Управление подключениями осуществляется с помощью панели инструментов (4):
en: Toolbar (4) is used for connection control:

source: Управляющие переменные не обязательно принимать от другого обработчика.
en: It is not required to accept control variables from another handler.

source: Упрощение описания исследуемых объектов.
en: Simplification of description of the objects under study.

source: Упрощение структуры Сценария объединением нескольких узлов, выполняющих определенный этап обработки данных, в один узел Подмодели.
en: Simplification of the Workflow structure is achieved by combination of several nodes performing particular stage of the data processing into one node of the Supernode.

source: Уровень логирования информация:
en: The information logging level:

source: Уровень логирования ошибка:
en: The error logging level:

source: Уровень логирования предупреждение:
en: The warning logging level:

source: Условие (ветвление)
en: Condition (branching)

source: Условие - логическое выражение;
en: Antecedent - logical expression.

source: Условия фильтрации в обработчике Фильтр строк
en: Filtering Conditions in the Row Filter Handler

source: Устанавливает значение целого типа больше 1.
en: It sets the integer value more than 1.

source: Устанавливается значение целого типа больше 0.
en: The integer value more than 0 is set.

source: Устанавливается значение целого типа в интервале от 2 до 100.
en: The integer value is set in the interval from 2 to 100.

source: Устанавливается по умолчанию для остальных столбцов.
en: It is set for other columns by default.

source: Устанавливается по умолчанию для прочих полей.
en: It is set for other fields by default.

source: Устанавливается при переобучении узла.
en: It is set when retraining the node.

source: Установить... — показывает зависимость IV от количества классов и позволяет выбрать их число для настройки максимального количества.
en: Set... shows dependence IV on classes count and enables to select their number to set the maximum count.

source: Установка данного параметра влияет на интерпретацию результатов WoE-анализа.
en: Selection of this parameter affects interpretation of the WoE analysis results.

source: Установленный флаг Пропущенные обеспечивает отображение в выходном наборе данных полей с пропущенными значениями.
en: The enabled Null checkbox displays the field data with null values in the output data set.

source: Утрированно бывают следующие типы переменных:
en: In general, there are the following types of variables:

source: Участвующие в агрегации поля как у агрегации Среднее.| | Стандартное отклонение||•|•||||Выводит среднеквадратическое отклонение по столбцу.
en: The fields that are included into the aggregation are as for the Average aggregation.| | Standard deviation||•|•||||It shows the mean-square deviation by column.

source: Участвующие в агрегации поля как у агрегации Среднее.| | Количество уникальных|•|•|•|•|•|•|Показывает количество уникальных значений записей.
en: The fields that are included into the aggregation are as for the Average aggregation.| | Count of unique|•|•|•|•|•|•|It displays the count of unique record values.

source: Учет зависимости между переменными.
en: Consideration of dependence between variables.

source: Ф. — экстремумы взаимнокорреляционной функции;
en: extremum: extremums of cross-correlation function.

source: Файл пакета
en: Package file

source: Файл хранит в себе настройки полей, что упрощает процесс импорта.
en: The file includes settings of fields that simplifies the import process.

source: Файловый менеджер вызывается по кнопке на Главном меню и предоставляет необходимый инструментарий для работы с файловым хранилищем.
en: The file manager is called using button of the Main Menu. This tool is required for the file storage operation.

source: Файлы при этом копируются.
en: In this case, files are copied.

source: Фактически
en: Actually

source: Фактически вспомогательные данные рассматриваются алгоритмом как еще одни элементы транзакций, и обозначение "вспомогательные" они имеют лишь в контексте аналитической задачи.
en: Actually, the supplementary data is considered by the algorithm as one more transaction item, and its "supplementary" context is used only when dealing with analytical tasks.

source: Фактом: Сумма продажи (Сумма).
en: Measure: Amount of sales (Amount).

source: Фактор, имеющий значение N, увеличит количество строк с интересующим нас уникальным значением в N раз в выходном наборе данных.
en: The factor with N value will increase the row count with the relevant unique value by N times in the output data set.

source: Фактор1
en: Factor 1

source: Фактор2
en: Factor 2

source: Факты
en: Measures

source: Факты в визуализаторе Куб образуются путем агрегирования соответствующих полей записей.
en: Measures in Cube visualizer are generated by aggregation of corresponding fields of records.

source: Факты для них будут агрегироваться в столбце Пропущенные значения.
en: Measures for them will be aggregated in the Null values column.

source: Физически все папки пользователей располагаются на сервере по следующему пути: "C:\ProgramData\BaseGroup\Loginom 6\UserStorage".
en: Physically, the following path is used for location of all user folders on the server: "C:\ProgramData\BaseGroup\Loginom 6\UserStorage".

source: Физический уровень
en: Physical Level

source: Фильтр Ходрика-Прескотта - имеет два взаимосвязанных параметра (одновременное редактирование параметров исключено), радиокнопки переключают на редактирование одного из них:
en: The Hodrick-Prescott filter has two interrelating parameters (simultaneous editing of parameters is excluded). Radio buttons switch to editing of one of them:

source: Фильтр выпадающего списка в состоянии оставляет только те поля, которые еще не связаны с какими-либо элементами, а в состоянии — предоставляет к выбору все поля.
en: The drop-down list filter in state displays only the fields that have not been connected with items yet, and it displays all fields for selection in state.

source: Финальный этап автоподбора производится методом "схождения к вершине" по всем четырем параметрам.
en: The final autofit stage is implemented using the "hill climbing" method for all four parameters.

source: Флаг Регистр позволяет выполнить поиск с учётом регистра.
en: Case-sensitive checkbox provides the case-sensitive search.

source: Формат - необязательный параметр формат даты/время в терминах D, M, Y, H, N, S, Z
en: Format - optional parameter date/time format in terms of D, M, Y, H, N, S, Z.

source: Формат - способ строкового представления GUID ("N", "D", "B", "P").
en: Format - method of GUID string representation ("N", "D", "B", "P").

source: Формат задаётся для типов данных:
en: The format is set for the data types:

source: Формат представления даты Свой формат далее будет рассмотрен более подробно.
en: The date representation format - Own format - will be further considered in details.

source: Формат строки подключения определяется используемым драйвером (см.
en: The string connection format is defined by the used driver (refer to

source: Формат строки при использовании встроенного драйвера может иметь вид:
en: The string format when the inbox driver is used can relate to the following kind:

source: Формат строки при использовании встроенного драйвера: <ServerName>:<Port>:<Instance>.
en: The string format when the inbox driver is used is as follows: <ServerName>:<Port>:<Instance>.

source: Формат строки при использовании клиента СУБД:
en: The string format when DBMS client is used is as follows:

source: Формат строки при использовании клиента СУБД: <ServerName>.
en: The string format when DBMS client is used is as follows: <ServerName>.

source: Формат строки: <ServerName>:<Port/Shared Memory>:<DatabaseName>, например localhost:3306:database1, а при использовании Shared-Memory возможно такое написание localhost:MYSQL:database1.
en: The following string format is used: <ServerName>:<Port/Shared Memory>:<DatabaseName>, for example, localhost:3306:database1. When Shared-Memory is used, the following way of writing is also possible: localhost:MYSQL:database1.

source: Формат строки: <ServerName>:<Port>:<DatabaseName>, например 192.168.0.180:5432:postgres, где.
en: The string format is as follows: <ServerName>:<Port>:<DatabaseName>, for example, 192.168.0.180:5432:postgres, where

source: Формат строки: <ServerName>:<Port>:<DatabaseName>, например host:1433:database1.
en: The following string format is used: <ServerName>:<Port>:<DatabaseName>, for example, host:1433:database1.

source: Формат\_времени - необязательный параметр формат времени в терминах H, N, S, Z.
en: Time_format - optional parameter time format in terms of H, N, S, Z.

source: Формат\_даты - необязательный параметр формат даты в терминах D, M, Y.
en: Date_format - optional parameter date format in terms of D, M, Y.

source: Форматирование можно применять одновременно к нескольким фактам.
en: Formatting can be applied to several measures at the same time.

source: Форматы DN, UPN или domain\user не поддерживаются и приведут к появлению ошибки "Неверное имя пользователя или пароль".
en: DN, UPN or domain\user formats are not supported and will cause the following error: "Invalid username or password".

source: Форматы:
en: Formats:

source: Формирование классов с весом меньше заданного не допускается.
en: It is not allowed to generate the classes with the weight that is less than the set one.

source: Формула выражения может содержать:
en: The expression formula can contain the following components:

source: Формула вычисления задается рекуррентным соотношением: EMA(t) = a * X(t) + (1 - a) * EMA(t-1), где EMA(k) - значение экспоненциально сглаженного скользящего среднего в точке k, a - параметр сглаживания, a = 2 / (n + 1), где n - ширина окна.
en: Calculation formula is defined by the recurrence equation: EMA(t) = a * X(t) + (1 - a) * EMA(t-1), where EMA(k) - the value of exponentially smoothed moving average in point k, a - smoothing parameter, a = 2 / (n + 1), where n - window width.

source: Формула вычисления скользящего среднего: MA = (X(t) + ... + X(t - n))/n.
en: Formula of the moving average calculation: MA = (X(t) + ... + X(t - n))/n.

source: Функции Калькулятора всегда начинаются с большой буквы, однако, их можно переопределить в коде JS.
en: The Calculator functions always start from the capital letter. However, it is possible to redefine them in the JS code.

source: Функции агрегации
en: Aggregation Functions

source: Функций работы со входными данными (Data, RowNum, RowCount, DisplayName, CumulativeSum) — имеются аналоги в API (RowCount, DisplayName) или легко реализуются кодом JS.
en: The functions of work with the input data (Data, RowNum, RowCount, DisplayName, CumulativeSum): there are analogues in API (RowCount, DisplayName), or they are easily implemented by the JS code.

source: Функционал компонента
en: Component functionality

source: Функция возвращает HEX значение MD5 рассчитанное от заданной строки.
en: Function returns HEX value MD5 calculated on the basis of the given string.

source: Функция возвращает HEX значение SHA1 рассчитанное от заданной строки.
en: Function returns HEX value SHA1 calculated on the basis of the given string.

source: Функция возвращает Строку, в которой вхождения Старого шаблона были заменены на Новый шаблон.
en: Function returns the String in which occurrences of the Old template were substituted with the New template.

source: Функция возвращает время, сформированное из указанных аргументов.
en: Function returns the time formed from the specified arguments.

source: Функция возвращает дату и время, сформированные из указанных аргументов.
en: Function returns the date and time formed from the specified arguments.

source: Функция возвращает дату начала указанной недели в соответствии со стандартом ISO 8601, по которому неделя начинается с понедельника и заканчивается воскресеньем.
en: Function returns the date of the specified week start according to ISO 8601 standard subject to which the week starts from Monday and ends with Sunday.

source: Функция возвращает дату, сформированную из указанных аргументов.
en: Function returns the date formed from the specified arguments.

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество дней.
en: Function returns the Date argument value, increased by the specified Number of days.

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество кварталов.
en: Function returns the Date argument value, increased by the specified Number of quarters.

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество лет.
en: Function returns the Date argument value, increased by the specified Number of years.

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество месяцев.
en: Function returns the Date argument value, increased by the specified Number of months.

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество недель.
en: Function returns the Date argument value, increased by the specified Number of weeks.

source: Функция возвращает значение логического типа TRUE (истина), если Значение содержится в списке, иначе результат равен FALSE (ложь).
en: Function returns the TRUE value of the logical type if the Value is in the list, otherwise the result is FALSE.

source: Функция возвращает значение поля ИмяСтолбца взятое из строки НомерСтроки.
en: Function returns the ColumnName field value taken from the RowNumber row.

source: Функция возвращает значение расстояния Дамерау-Левенштейна для строк Строка1, Строка2.
en: Function returns the value of the Damerau–Levenshtein distance for String1, String2.

source: Функция возвращает значение расстояния Левенштейна для строк Строка1, Строка2.
en: Function returns the value of the Levenshtein distance for String1, String2.

source: Функция возвращает метку (отображаемое имя) по имени поля, переменной или выражения.
en: Function returns the caption (display name) according to the field name, variable or expression.

source: Функция возвращает номер текущей записи источника данных.
en: Function returns the current record number of the data source.

source: Функция возвращает позицию первого символа Подстроки заданного Порядка в Строке.
en: Function returns position of the first character of the Substring of the set MatchIndex in the String.

source: Функция возвращает пустое значение.
en: Function returns the null value.

source: Функция возвращает строковое представление GUID в указанном формате: "N" - 32 цифры; "D" - 32 цифры, разделенные дефисами; "B" - 32 цифры, разделенные дефисами и заключенные в фигурные скобки; "P" - 32 цифры, разделенные дефисами и заключенные в круглые скобки; Если формат не указан, то используется формат "B".
en: Function returns GUID string representation in the specified format: "N" - 32 digits; "D" - 32 hyphenated digits; "B" - 32 hyphenated digits and digits in curved brackets; "P" - 32 hyphenated digits and digits in round brackets. If the format is not specified, use of "B" format is required.

source: Функция возвращает число - значение CRC32 рассчитанное от заданной строки.
en: Function returns the number - CRC32 value calculated on the basis of the given string.

source: Функция возвращает число строк в источнике данных.
en: Function returns the row count in the data source.

source: Функция конвертирует строку, содержащую дату в формат типа "Дата/Время".
en: Function converts the string containing the date into the "Date/Time" format.

source: Функция плотности гамма-распределения хи-квадрат.
en: Density function of gamma distribution of Chi-square.

source: Функция, которая определяет вероятность появления значений параметров регрессионной модели для заданного значения независимой переменной x
en: The function that defines occurrence probability of values of the regression model parameters for the set value of independent variable x

source: Характеристика связи между зависимой y и независимой переменной x
en: Characteristics of relation between dependent variable y and independent variable x

source: Хлеб
en: Bread

source: Хорошо
en: Good

source: Хранилища данных:
en: Data Warehouses:

source: Хранить данные в специальных структурах с учетом особенностей каждого алгоритма.
en: To keep data in special structures taking into account peculiarities of each algorithm.

source: Цвет — указывается цвет диаграммы.
en: Color: the chart color is specified.
